Repository: Jpinsoft/LangFromText
Catalog: LangFromTextWinApp/Properties/Resources.*.resx
Languages: sk

# T002
source: Cancel
sk: Zrušiť

# T003
source: Sentence
sk: Veta

# T005
source: Information
sk: Info

# T006
source: Warning
sk: Upozornenie

# T007
source: Error
sk: Chyba

# T008
source: Question
sk: Otázka

# T009
source: LangFromtext is a desktop lang-trainer application based on your "self-made" database. You need more data. Please index web or text files and populate your text database.
sk: LangFromText je aplikácia určená pre tréning jazykov založená na vašej vlastnej databáze textov. Začnite naplnením databázy textov, aby ste mohli naplno využívať funkcie aplikácie.

# T010
source: Nicely, your database contains {0} words which is enough.
sk: Výborne, vaša databáza obsahuje {0} slov, čo je dostatočný počet.

# T012
source: Well, your database consists of {0} text sources ({1} text source per 1000 words).
sk: Výborne, vaša databáza je naplnená z {0} rôznych zdrojov. Hodnota indexu rozmanitosti je {1}

# T013
source: There are only {0} text sources per 1000 words. Try to get more text sources from web or files.
sk: Na 1000 slov pripadá iba {0} textových zdrojov. Skúste získať ďalšie textové zdroje z webu, alebo súborov.

# T014
source: Start filling the database
sk: Štart naplnenia databázy

# T018
source: Your database contains enough data and you can fully use application.
sk: Vaša databáza je naplnená a tak môžete využívať aplikáciu naplno.

# T019
source: Are you sure you want to delete text source '{0}'?
sk: Chcete naozaj zmazať údaje zo zdroja textov '{0}'?

# T020
source: File does not exist
sk: Súbor sa nenašiel

# T021
source: Total Score: {0}
sk: Celkové skóre: {0}

# T022
source: Database File is probably corrupted. Application will try to create new database file. Please check Settings if you want to change current database.
sk: Súbor databázy je zrejme poškodený, preto bude vytvorený nový prázdny súbor databázy. Pre zmenu súboru databázy použite sekciu Nastavenia.

# T023
source: Scan level
sk: Úroveň skenovania

# T024
source: Only url that contains
sk: Iba URL adresy, ktoré obsahujú

# T025
source: Only url that not contains
sk: Iba URL adresy, ktoré neobsahujú

# T026
source: Database Name
sk: Databáza

# T027
source: Database folder
sk: Adresár databázy

# T028
source: Create database
sk: Vytvoriť databázu

# T029
source: PHRASE
sk: Fráza

# T030
source: TEXT SOURCES
sk: Zdroje textov

# T031
source: HIDE
sk: SKRYŤ

# T034
source: TextSources
sk: Textové zdroje

# T035
source: Words
sk: Slová

# T036
source: Search (Enter)
sk: Hľadať (Enter)

# T037
source: Occurrence
sk: Výskyty

# T038
source: Text Sources
sk: Zdroje

# T040
source: Word
sk: Slovo

# T041
source: Get text source from files
sk: Získať texty zo súborov

# T042
source: Show sentences
sk: Zobraziť vety

# T043
source: Phrase checker
sk: Kontrola fráz

# T044
source: Evaluate (Enter)
sk: Vyhodnoť (Enter)

# T045
source: Match
sk: Zhoda

# T046
source: Phrase pattern
sk: Vzor frázy

# T047
source: Current Database
sk: Aktuálna databáza

# T048
source: Change DB
sk: Zmeniť DB

# T049
source: New Database
sk: Vytvoriť databázu

# T050
source: Automatic lang-trainer interval
sk: Automatický tréning jazyka

# T051
source: Settings
sk: Nastavenia

# T052
source: Welcome!
sk: Vitajte!

# T053
source: Your database contains {0} words, you need at least {1} words.
sk: Vaša databáza obsahuje {0} slov. Potrebujete minimálne {1} slov.

# T054
source: Automatic lang-trainer is enabled. You can turn it off in section
sk: Automatický tréning jazyka je zapnutý. Vypnete ho v sekcii

# T055
source: Automatic lang-trainer is disabled. You can turn it on in section
sk: Automatický tréning jazyka je vypnutý. Zapnete ho v sekcii

# T056
source: Text Source Detail
sk: Detail zdroja textov

# T058
source: Get text source from web
sk: Získať texty z webu

# T059
source: Cancelling...
sk: Ruším operáciu...

# T060
source: Cancel scan
sk: Zrušiť indexáciu

# T061
source: Default Language
sk: Podľa operačného systému

# T062
source: Slovak
sk: Slovenský

# T063
source: English
sk: Anglický

# T064
source: Color Theme
sk: Téma rozhrania

# T065
source: Language
sk: Jazyk

# T066
source: Are you sure you want to delete {0} items?
sk: Chcete naozaj zmazať {0} položiek?

# T067
source: Working... Please wait
sk: Pracujem... Čakajte prosím

# T068
source: Loading database... Please wait
sk: Načítavam databázu... Čakajte prosím

# T069
source: File indexer: '{0}' files was successfully indexed.
sk: File indexer: '{0}' súborov bolo úspešne indexovaných.

# T070
source: Let's go
sk: Začať

# T071
source: Maybe later
sk: Teraz nie

# T072
source: It's time for a quick lang-training...
sk: Je čas na krátky jazykový tréning...

# T073
source: Start page
sk: Úvod

# T074
source: Lang-games
sk: Jazyko-hry

# T076
source: Automatically launch app after the user login
sk: Spustiť aplikáciu automaticky po prihlásení do systému

# T077
source: About
sk: O aplikácii

# T078
source: An open-source desktop lang-trainer application based on your self-made database. LangFromText is released under the GPLv3 (GNU GENERAL PUBLIC LICENSE) https://github.com/Jpinsoft/LangFromText LangFromText was made possible thanks to these excellent libraries: ------------------- Font-Awesome-WPF/UWP Copyright (c) 2014-2016 charri The MIT License (MIT) https://github.com/charri/Font-Awesome-WPF/ Json.NET Copyright (c) 2007 James Newton-King The MIT License (MIT) https://www.newtonsoft.com/json Html Agility Pack (HAP) Copyright (c) ZZZ Free Projects 2014-2017 The MIT License (MIT) https://html-agility-pack.net/ https://github.com/zzzprojects/html-agility-pack
sk: Desktopová open-source aplikácia pre tréning jazykov založená na vašej vlastnej databáze textov. LangFromText je publikovaný pod licenciou GPLv3 (GNU GENERAL PUBLIC LICENSE) https://github.com/Jpinsoft/LangFromText LangFromText bol vytvorený aj vďaka týmto vynikajúcim knižniciam: ------------------- Font-Awesome-WPF/UWP Copyright (c) 2014-2016 charri The MIT License (MIT) https://github.com/charri/Font-Awesome-WPF/ Json.NET Copyright (c) 2007 James Newton-King The MIT License (MIT) https://www.newtonsoft.com/json Html Agility Pack (HAP) Copyright (c) ZZZ Free Projects 2014-2017 The MIT License (MIT) https://html-agility-pack.net/ https://github.com/zzzprojects/html-agility-pack

# T079
source: Unable to initialize application. App will Close.
sk: Zlyhala inicializácia aplikácie a bude ukončená.

# T081
source: DISABLED: Start every {0} minutes
sk: VYPNUTÝ: Spúšťať každých {0} minút

# T082
source: Start every {0} minutes
sk: Spúšťať každých {0} minút

# T083
source: Please restart application to apply changes.
sk: Zmena sa prejaví až po reštarte aplikácie.

# T084
source: ----- Please enter a valid URL address -----
sk: ----- Prosím zadajte URL adresu -----

# T085
source: Open LangFromText
sk: Otvoriť LangFromText

# T086
source: Lang-trainer - random game
sk: Lang-trainer - náhodná hra

# T087
source: Exit
sk: Koniec

# T088
source: URL template - open translator
sk: URL šablóna - otvorenie prekladača

# T089
source: Show Translation
sk: Zobraziť preklad

# T090
source: Are you sure you want to reset score data for this module?
sk: Naozaj chcete zmazať údaje o skóre pre tento modul?

# T091
source: Reset score
sk: Resetovať skóre

# T092
source: Do you really want to reset URL template to the default value '{0}'?
sk: Naozaj chcete resetovať odkaz na prednastavenú hodnotu '{0}'?

# T200
source: Complete the word
sk: Doplňte slovo

# T201
source: Select the correct phrase
sk: Nájdi správnu vetu

# T202
source: Select the correct word
sk: Označte správne slová

# T203
source: Vocabulary training
sk: Tréning slovnej zásoby

# T204
source: Not enough words. Use the Data tab to get more text sources from web or files.
sk: Nedostatok slov. Použite záložku Data pre získanie ďalších textových zdrojov z webu, alebo súborov.

# T205
source: Do you know this word?
sk: Poznáš toto slovo?
